public class lesson_12_16 {
    //Популярные ошибки компилятора

    //1. Забыли точку с запятой
    //2. Забыли закрыть кавычки
    //3. Забыли знак плюс при склеивании строк
    //4. Забыли закрыть фигурные скобки
    //5. Забыли написать круглые скобки
    //6. Неправильно написан заголовок метода main
    //7. Имя файла отличается от имени класса
    //8. Забыли написать package
    //9. Забыли добавить import
    //10. Сравнение объектов с помощью ==
    //11. Изменение объекта String
    //12. Забыли проинициализировать объекты, являющиеся элементами массива
    //13. Подмена поля класса локальной переменной.
    //14. Удаление элемента коллекции
    //15. Помещение в один файл сразу нескольких классов с модификатором public
    //16. Вызов обычных методов класса из статического метода main()
    //17. Объявление конструктора как метода
    //18. Неверное наследование интерфейсов
    //19. Пропуск слова break в операторе switch

}
